<?php
/**
 * Малко приложение, което приема команди
 * от стандартния вход (конзолата) за:
 *    - регистрация потребители във форум
 *    - логин на потребители (Съществуващи)
 *    - създаване на въпроси във форума от
 *       определени автори (от текущо-логнатия
 *       потребител)
 *    - създаване на отговори на въпроси
 *         (пак от автори и т.н.)
 *    - коментари на отговори ...
 */

 /**
  * Потребители
  *      - Пореден номер (тип инт)
  *      - Име  (тип стринг)
  *      - Парола (тип стринг)
  *      - ЗададениВъпроси (тип Въпрос масив - Въпрос[])
  *      - СъздадениОтговори (тип Отговор масив - Отговор[])
  *      - КоментариНаОтговори (тип Отговор масив - Отговор[])
  *
  * Въпроси
  *      - Пореден номер (тип инт)
  *      - Заглавие (тип стринг)
  *      - Съдържание (тип стринг)
  *      - Автор (тип Потребител)
  *      - Отговори (тип Отговор масив - Отговор[])
  *
  * Отговори
  *      - Пореден номер (тип инт)
  *      - Съдържание (тип стринг)
  *      - ВъпросНаКойтоЕОтговорено (тип Въпрос)
  *      - ОтговорНаКойтоЕКоментирано (тип Отговор)
  *      - Коментари (тип Отговор масив - Отговор[]);
  *
  *
  */

 /**
  * register {username} {password}
  * login {username} {password}
  * ask {title} {body}
  * answer {questionId} {body}
  * comment {answerId} {body}
  */

spl_autoload_register(function($class) {
    $class = $class . '.php';
    require_once $class;
});

$forum = new Forum();
$forum->start();
